## Importing the Pandas Library and dataset

In [2]:
import pandas as pd

In [3]:
data= pd.read_csv('temporary_instagram')

In [4]:
data.shape

(10494, 3)

In [5]:
data.head()

,pk,username,biography
0,561624374,ruslankhoma,none
1,3100245616,lukeladeur,EDM | The Office | Tacos\nUniversity of Kansas...
2,1392217914,p.swi,UIUC '19
3,18771979,brianna.moling,uic ‘22 | sc: briannaa.taylor
4,4386316947,akukhtyn,none

## Removing users with no biography

In [10]:
data=data.loc[data['biography']!='none']

In [11]:
data.shape

(8726, 3)

## Renoving symbols, smileys and other non-useful keys from biography

In [13]:
def convert_to_string(value):
    value = str(value)
    return value.encode('ascii','ignore').decode("utf-8")

In [14]:
data['biography']=data.biography.apply(convert_to_string)

In [15]:
data.head()

,pk,username,biography
1,3100245616,lukeladeur,EDM | The Office | Tacos\nUniversity of Kansas...
2,1392217914,p.swi,UIUC '19
3,18771979,brianna.moling,uic 22 | sc: briannaa.taylor
5,12421857172,vitaliyvoz,Chicago \nUIC 18
7,4221164414,themayfairgroup,PR CONTENT SOCIAL SALES MERCH\n@wildflower...

## Removing instagram users that were repeated

In [16]:
key=['pk']
data.drop_duplicates(subset=key, keep='first', inplace=True)

In [18]:
data.shape[0]

8195

## Lets check the impact of \r

In [19]:
print("My Name is \r Devansh")

 Devansh

In [20]:
print("My Name is Devansh")

My Name is Devansh

In [21]:
print("I \r am Devansh Popat")

 am Devansh Popat

## We dont want unessential spaces and lines in biography

In [22]:
def strip_newlines(value):
    return value.replace('\n', ' ').replace('\r', '')

In [23]:
data['biography']=data.biography.apply(strip_newlines)

## Used this function to

In [25]:
pd.set_option('display.max_colwidth', -1)

In [26]:
data.head()

,pk,username,biography
1,3100245616,lukeladeur,EDM | The Office | Tacos University of Kansas '17 Sunset Music Festival Chicago
2,1392217914,p.swi,UIUC '19
3,18771979,brianna.moling,uic 22 | sc: briannaa.taylor
5,12421857172,vitaliyvoz,Chicago UIC 18
7,4221164414,themayfairgroup,PR CONTENT SOCIAL SALES MERCH @wildflowercases @sage_thelabel @yunis_k @notanotherlabel @eastnwestlabel @cuffedbynano @setactive